In [3]:
df = read.csv('Chapter9/Du_lieu/states1.csv')
head(df)

  X          Population Income Illiteracy Life.Exp Murder HS.Grad Frost Area
1 Alabama     3615      3624   2.1        69.05    15.1   41.3     20    50708
2 Alaska       365      6315   1.5        69.31    11.3   66.7    152   566432
3 Arizona     2212      4530   1.8        70.55     7.8   58.1     15   113417
4 Arkansas    2110      3378   1.9        70.66    10.1   39.9     65    51945
5 California 21198      5114   1.1        71.71    10.3   62.6     20   156361
6 Colorado    2541      4884   0.7        72.06     6.8   63.9    166   103766

In [4]:
df1 = df[df$Income > 4500 & df$Population > 10000,]

In [5]:
df1

   X          Population Income Illiteracy Life.Exp Murder HS.Grad Frost Area
5  California 21198      5114   1.1        71.71    10.3   62.6     20   156361
13 Illinois   11197      5107   0.9        70.14    10.3   52.6    127    55748
32 New York   18076      4903   1.4        70.55    10.9   52.7     82    47831
35 Ohio       10735      4561   0.8        70.82     7.4   53.2    124    40975